Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
#include "stm32f4xx_hal.h"
#include "pin_config.h"
#include "crc8.h"
#include "pi_link.h"
#include "bmi088.h"
#include "ddsm315.h"
#include "st3215.h"
#include "mahony.h"
#include "kinematics.h"
#include "lqr_controller.h"
#include "safety_state.h"
#include "servo_mapping.h"

/* Peripheral Handles */
I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart1; /* CH340 Debug/Program */
UART_HandleTypeDef huart2; /* DDSM RS485 */
UART_HandleTypeDef huart3; /* ST3215 Half-Duplex Servo */
UART_HandleTypeDef huart6; /* Pi 5 Bridge */
IWDG_HandleTypeDef hiwdg;
DMA_HandleTypeDef hdma_usart6_rx;

/* Real-Time Telemetry and State variables */
volatile uint32_t g_system_ticks = 0;
BMI088_t g_imu;
MahonyFilter_t g_mahony;
LQRController_t g_lqr;

DDSM_State_t g_ddsm_left;
DDSM_State_t g_ddsm_right;
ST3215_State_t g_servos[4];

/* Wheel torque commands computed and sent together at each 250 Hz deadline. */
static float g_ctrl_tau_l = 0.0f;
static float g_ctrl_tau_r = 0.0f;
static volatile float g_body_gyro[3] = {0.0f, 0.0f, 0.0f};

/* Max consecutive servo failures before a fatal FAULT lockdown */
#define SERVO_FAIL_LIMIT         3

/* DMA Buffer for Pi Bridge (USART6 RX) */
#define PI_RX_BUF_SIZE           128
uint8_t g_pi_rx_buf[PI_RX_BUF_SIZE];

/* Function Prototypes */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_DMA_Init(void);
static void MX_IWDG_Init(void);
static void System_Initial_Setup(void);
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act);
void Error_Handler(void);

int main(void) {
    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock to 168 MHz */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_I2C1_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_USART6_UART_Init();
    MX_IWDG_Init();

    /* Initialize drivers, CRC tables and control states */
    crc8_init();
    pi_link_init();
    safety_state_init();
    lqr_init(&g_lqr);
    mahony_init(&g_mahony, 2.0f, 0.005f); /* Kp = 2.0, Ki = 0.005 */

    g_ddsm_left.id = DDSM_LEFT_ID;
    g_ddsm_right.id = DDSM_RIGHT_ID;
    device_health_init(&g_ddsm_left.health);
    device_health_init(&g_ddsm_right.health);
    for (int i = 0; i < 4; i++) {
        g_servos[i].id = i + 1; /* IDs: 1, 2, 3, 4 */
        device_health_init(&g_servos[i].health);
        g_servos[i].health.online = 1U; /* optimistic discovery; first valid read timestamps it */
    }

    /* Start Pi Link bridge USART6 reception via DMA */
    __HAL_UART_ENABLE_IT(&huart6, UART_IT_IDLE);
    HAL_UART_Receive_DMA(&huart6, g_pi_rx_buf, PI_RX_BUF_SIZE);

    /* Run initial sensor detection and calibration */
    System_Initial_Setup();

#if SERVO_ZERO_CALIBRATION_MODE
    /* A calibration image must never leave INIT and start commanding the
     * placeholder center ticks. FAULT keeps wheel commands at zero while the
     * background servo feedback poll remains active. */
    safety_state_trigger_fault(FAULT_SERVO);
#endif

    uint32_t last_tick = 0;
    uint32_t last_left_tick = 0;
    uint32_t last_right_tick = 1;
    uint32_t last_servo_loop_time = 0;
    uint8_t active_servo_query_idx = 0;
    uint32_t temp_refresh_counter = 0;

    /* Main background scheduler loop */
    while (1) {
        /* Soft real-time scheduler aligned to system ticks (1ms resolution) */
        if (g_system_ticks != last_tick) {
            /* Use the actual elapsed time; blocking bus I/O can skip ticks */
            uint32_t dticks = g_system_ticks - last_tick;
            last_tick = g_system_ticks;
            float fusion_dt = (float)dticks * 0.001f;
            HAL_IWDG_Refresh(&hiwdg);

            /* 1. Read IMU sensors (safe to do here in the main loop background) */
            bmi088_read_accel(&g_imu);
            bmi088_read_gyro(&g_imu);

            /* Refresh chip temperature at low rate (~10 Hz) for safety/telemetry */
            if (++temp_refresh_counter >= 100) {
                temp_refresh_counter = 0;
                bmi088_read_temp(&g_imu);
            }

            float gx = g_imu.gyro[0];
            float gy = g_imu.gyro[1];
            float gz = g_imu.gyro[2];

            /* 2. Run sensor fusion update */
            if (g_safety_state.is_gyro_calibrated) {
                gx -= g_safety_state.gyro_calib_offset[0];
                gy -= g_safety_state.gyro_calib_offset[1];
                gz -= g_safety_state.gyro_calib_offset[2];

                mahony_update(&g_mahony,
                              g_imu.accel[0], g_imu.accel[1], g_imu.accel[2],
                              gx, gy, gz, fusion_dt);
            } else {
                safety_state_gyro_calib_update(gx, gy, gz);
            }
            g_body_gyro[0] = gx;
            g_body_gyro[1] = gy;
            g_body_gyro[2] = gz;

            /* Balance-relevant tilt & rate mapped to the physical IMU mounting.
             * Pitch rate uses the bias-corrected gyro (offset is 0 until calibrated). */
            float body_pitch = ATT_PITCH(&g_mahony);
            float body_pitch_rate = ATT_PITCH_RATE_SIGN *
                (g_imu.gyro[ATT_PITCH_RATE_IDX] - g_safety_state.gyro_calib_offset[ATT_PITCH_RATE_IDX]);

            /* 3. Run the 250 Hz motor deadline and lower-rate telemetry slots. */
            uint8_t slot = last_tick % 4;
            uint8_t control_due = (uint32_t)(last_tick - last_left_tick) >= 4u;
            uint8_t right_due = (uint32_t)(last_tick - last_right_tick) >= 4u;

            /* Safety state machine update (at 250 Hz, inside slot scheduler) */
            if (control_due) {
                last_left_tick = last_tick;
                float max_temp = g_imu.temperature;
                for (int i = 0; i < 4; i++) {
                    if (g_servos[i].temperature_c > max_temp) {
                        max_temp = g_servos[i].temperature_c;
                    }
                }
                safety_state_update(body_pitch, body_pitch_rate, max_temp, 0.004f);
            }

            /* --- Slot 0: Compute LQR (once/cycle), command & poll Left DDSM --- */
            if (control_due) {
                if (g_safety_state.current_mode != STATE_FAULT && g_safety_state.current_mode != STATE_INIT) {
                    /* Snapshot Pi commands atomically (updated in USART6 ISR) */
                    Pi_Command_Heartbeat_t hb;
                    Pi_Command_Action_t act;
                    Pi_Command_Snapshot(&hb, &act);
                    /* Average wheel velocity in body frame -> forward speed ẋ.
                     * All command and residual fields now use the shared P0 contract. */
                    float wheel_vel_l = WHEEL_DIR_L * g_ddsm_left.velocity_rads;
                    float wheel_vel_r = WHEEL_DIR_R * g_ddsm_right.velocity_rads;
                    float yaw_rate = gz;
                    if (!pi_link_is_compatible() || !pi_link_heartbeat_fresh()) {
                        /* Enter a fresh local hold reference immediately; do not
                         * jerk-limit a stale command back to zero from its old
                         * moving reference. */
                        lqr_reset(&g_lqr, g_lqr.x_est, g_mahony.yaw);
                    }

